{
  "title": "ยินดีต้อนรับ",
  "description": "เปลี่ยนภาษาโดยใช้ปุ่มด้านล่าง",
  "menu": {
    "home": "หน้าแรก",
    "about": "เกี่ยวกับฉัน",
    "portfolio": "ผลงาน",
    "contact": "ติดต่อฉัน",
    "hire": "จ้างฉัน"
  },
  "profile": {
    "greeting": "สวัสดีครับ ผมชื่อ",
    "name": "นาย ทัตธน สังขจร",
    "roles": ["วิศวกรรมซอฟต์แวร์", "วิศวกรรมเครือข่าย"],
    "hire": "สนใจร่วมงาน",
    "download_cv": "ดาวน์โหลดเรซูเม่",
    "experiences": "ประสบการณ์การทำงาน",
    "projects": "โปรเจกต์ที่เคยทำ",
    "repositories": "คลังโค้ด GitHub"
  },
  "about": {
    "title": "เกี่ยวกับฉัน",
    "subtitle": "ขออนุญาตแนะนำตัวเล็กน้อย",
    "intro_heading": "สวัสดีครับ ผมเป็นบัณฑิตวิศวกรรมคอมพิวเตอร์จาก มทส.",
    "intro_description": "ผมเพิ่งจบการศึกษาจากมหาวิทยาลัยเทคโนโลยีสุรนารี สาขาวิศวกรรมคอมพิวเตอร์ และมีความสนใจในการพัฒนาเว็บแอปพลิเคชัน รวมถึงระบบเครือข่ายคอมพิวเตอร์ ระหว่างที่เรียน ผมมีโอกาสได้ทำโปรเจกต์หลากหลาย ทั้งในรายวิชาและส่วนตัว โดยใช้เทคโนโลยีอย่าง React, Angular, Node.js, Gin Framework และ Express.js ปัจจุบัน ผมกำลังพัฒนาทักษะด้าน backend และ DevOps โดยเน้นไปที่ Golang และกำลังศึกษาหลักการออกแบบซอฟต์แวร์ เช่น Clean Architecture และ Design Patterns เพื่อสร้างระบบที่ดูแลรักษาง่ายและต่อยอดได้ในระยะยาว",
    "download_cv": "ดาวน์โหลดเรซูเม่",
    "skills": "ทักษะของฉัน"
  },
  "portfolio": {
    "title": "ผลงานของฉัน",
    "subtitle": "ชมโปรเจกต์ล่าสุดและงานอดิเรกที่ผมทำ",
    "view_project": "ดูโปรเจกต์ →"
  },
  "projects": {
    "hr_onboarding": {
      "title": "ระบบจัดการพนักงานใหม่",
      "description": "แอปพลิเคชันที่ช่วยให้ฝ่าย HR จัดการขั้นตอนการเริ่มงานของพนักงานใหม่ได้ง่ายขึ้น ตั้งแต่การประเมินผลช่วงทดลองงาน ไปจนถึงระบบแจ้งเตือนผ่านอีเมล ช่วยลดภาระงานเอกสาร และติดตามความคืบหน้าของพนักงานใหม่ได้อย่างมีประสิทธิภาพ"
    },
    "portfolio_theme": {
      "title": "เว็บไซต์พอร์ตโฟลิโอ ธีม Animation",
      "description": "เว็บพอร์ตโฟลิโอที่ผมพัฒนาขึ้น โดยเน้นความสวยงามของ Animation ผสมผสานกับเทคนิคด้าน Frontend อย่าง Three.js, Framer Motion และ Tailwind CSS "
    },
    "sut_attendance": {
      "title": "ระบบเช็กชื่อออนไลน์ มทส.",
      "description": "ระบบเช็กชื่อเข้าเรียนที่นักศึกษาสามารถสแกน QR Code และล็อกอินผ่าน Line ได้อย่างสะดวก พร้อมเชื่อมต่อกับ Line OA สำหรับการแจ้งเตือน ส่วนอาจารย์สามารถสร้างห้องเรียน สร้าง QR Code และดูประวัติการเข้าเรียนได้ผ่านแดชบอร์ด"
    },
    "cat_voice": {
      "title": "Cat’s Voice",
      "description": "เว็บแพลตฟอร์มเพื่อช่วยหาบ้านให้แมวจร มีระบบจัดการข้อมูลเคสแมว การรักษา กิจกรรม และผู้ขอรับเลี้ยง รวมถึงระบบรับบริจาค พัฒนาให้อัปเดตสถานะได้แบบเรียลไทม์ผ่าน UI ที่เป็นมิตรต่อผู้ใช้"
    },
    "key_store": {
      "title": "ร้านขายคีย์ซอฟต์แวร์ออนไลน์",
      "description": "เว็บไซต์ขายคีย์ซอฟต์แวร์ที่ผมพัฒนาร่วมกับเพื่อนในรายวิชา Software Engineering มีระบบให้ผู้ใช้เลือกสินค้า ใส่ตะกร้า ใช้โค้ดส่วนลด และชำระเงินได้ในไม่กี่ขั้นตอน ฝั่งแอดมินสามารถจัดการสินค้า ดูรายการสั่งซื้อ และตรวจสอบสถานะการชำระเงินผ่านแดชบอร์ดแบบครบวงจร เป็นโปรเจกต์ที่ได้ลงมือทั้งฝั่ง frontend และ backend จริง"
    }
  },
  "contact": {
    "title": "ติดต่อฉัน",
    "description": "หากคุณมีข้อสงสัย โปรเจกต์ที่อยากร่วมงาน หรือเพียงแค่ต้องการพูดคุย สามารถติดต่อผ่านแบบฟอร์มด้านล่างได้เลยครับ ผมจะพยายามตอบกลับโดยเร็วที่สุด"
  }
}
